Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрНакопления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНакопления</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПродажаТовара/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	Движения.РегистрНакопления.Записывать = Истина;
	Движения.РегистрНакопления.Записать();
	
   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	ПродажаТовараСписокНоменклатура.Количество КАК Количество,
		|	ПродажаТовараСписокНоменклатура.СрокГодности КАК СрокГодности
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажи
		|ИЗ
		|	Документ.ПродажаТовара.СписокНоменклатура КАК ПродажаТовараСписокНоменклатура
		|ГДЕ
		|	ПродажаТовараСписокНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажи.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаПродажи.Количество КАК Количество,
		|	ВременнаяТаблицаПродажи.СрокГодности КАК СрокГодности,
		|	РегистрНакопленияОстатки.СрокГодности КАК СрокГодности1,
		|	РегистрНакопленияОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВременнаяТаблицаПродажи.СрокГодности = РегистрНакопленияОстатки.СрокГодности КАК Приоритет
		|ИЗ
		|	ВременнаяТаблицаПродажи КАК ВременнаяТаблицаПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления.Остатки(&Дата, ) КАК РегистрНакопленияОстатки
		|		ПО ВременнаяТаблицаПродажи.Номенклатура = РегистрНакопленияОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ,
		|	ВременнаяТаблицаПродажи.СрокГодности
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если  ВыборкаНоменклатура.Количество >  ВыборкаНоменклатура.КоличествоОстаток Тогда
			Сообщить("Недостаточно товара " + ВыборкаНоменклатура.Номенклатура + " в кол-ве " +
		(ВыборкаНоменклатура.КоличествоОстаток - ВыборкаНоменклатура.Количество));
			Отказ = Истина;
		КонецЕсли;  
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	    ОсталосьСписать = ВыборкаНоменклатура.Количество;
        
		Пока ВыборкаДетальныеЗаписи.Следующий() И ОсталосьСписать > 0 Цикл
			КоличествоСписывания = Мин(ОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Движение = Движения.РегистрНакопления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности1;
			Движение.Количество = КоличествоСписывания;
			ОсталосьСписать = ОсталосьСписать - КоличествоСписывания;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
